-- MySQL dump 10.13  Distrib 8.3.0, for macos14.2 (arm64)
--
-- Host: localhost    Database: course1
-- ------------------------------------------------------
-- Server version	8.3.0

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Current Database: `course1`
--

CREATE DATABASE /*!32312 IF NOT EXISTS*/ `course1` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;

USE `course1`;

--
-- Table structure for table `course`
--

DROP TABLE IF EXISTS `course`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `course` (
  `id` int NOT NULL AUTO_INCREMENT,
  `year` int NOT NULL,
  `semester` varchar(45) NOT NULL,
  `gubun` varchar(45) NOT NULL,
  `code` varchar(45) NOT NULL,
  `title` varchar(45) NOT NULL,
  `professorId` int NOT NULL,
  `sigan` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `FK_course_professor_idx` (`professorId`),
  CONSTRAINT `FK_course_professor` FOREIGN KEY (`professorId`) REFERENCES `professor` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=100 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `course`
--

LOCK TABLES `course` WRITE;
/*!40000 ALTER TABLE `course` DISABLE KEYS */;
INSERT INTO `course` VALUES (1,2013,'1학기','전필','AH007-13','자바프로그래밍',2,'405/화/16:30~17:45'),(2,2014,'1학기','전필','AH007-14','자바프로그래밍',2,'202/화/15:00~16:15'),(3,2015,'1학기','전필','AH017-15','과정지도3',2,'202/화/14:00~14:50'),(4,2014,'2학기','전필','AH021-14','자료구조론',2,'202/화/16:30~17:45'),(5,2013,'2학기','전필','AH021-13','자료구조론',2,'202/화/15:00~16:15'),(6,2016,'2학기','전필','AH039-16','과정지도4',2,'202/화/14:00~14:50'),(7,2015,'2학기','전필','AH021-15','자료구조론',2,'202/금/15:00~17:45'),(8,2022,'2학기','전필','AH021-22','자료구조론',2,'202/화/16:30~17:45'),(9,2013,'2학기','전필','AH039-13','과정지도4',2,'202/목/14:00~14:50'),(10,2014,'1학기','전필','AH003-14','데이타베이스개론',1,'202/월/15:00~16:15'),(11,2014,'1학기','전선','AH006-14','시스템분석 및 설계',1,'202/월/16:30~17:45'),(12,2014,'1학기','전선','AH036-14','C++프로그래밍',1,'202/수/12:00~14:45'),(13,2014,'2학기','전선','AH024-14','UNIX',1,'202/수/12:00~14:50'),(14,2014,'2학기','전선','AH028-14','데이터베이스실습',1,'202/월/15:00~16:15'),(15,2015,'2학기','전선','AH037-15','웹페이지구축III',1,'202/월/16:30~17:45'),(16,2015,'2학기','전선','AH024-15','UNIX',1,'405/수/12:00~14:45'),(17,2017,'2학기','전선','AH028-17','데이터베이스실습',1,'405/월/16:30~17:45'),(18,2016,'2학기','전선','AH037-16','웹페이지구축III',1,'405/월/15:00~16:15'),(19,2015,'1학기','전필','AH002-15','컴퓨터구조',3,'302/화/09:00~10:15'),(20,2015,'1학기','전선','AH009-15','데이터통신',3,'402/화/15:00~16:15'),(21,2015,'1학기','전선','AH029-15','사물인터넷기초',3,'405/화/10:30~11:45'),(22,2015,'1학기','전필','AH033-15','졸업지도',3,'402/화/13:00~13:50'),(23,2016,'2학기','전필','AH005-16','운영체제론',3,'302/화/10:30~11:45'),(24,2015,'2학기','전선','AH018-15','사물인터넷 캡스톤디자인',3,'405/화/12:00~14:50'),(25,2015,'2학기','전필','AH005-15','운영체제론',3,'302/화/10:30~11:45'),(26,2016,'2학기','전선','AH018-16','사물인터넷 캡스톤디자인',3,'405/목/12:00~14:45'),(27,2015,'2학기','전선','AH019-15','C프로그래밍Ⅱ',3,'202/월/10:30~11:45'),(28,2016,'1학기','전필','AH010-16','알고리즘',4,'202/월/09:00~10:15'),(29,2016,'1학기','전선','AH011-16','고급웹프로그래밍 I',4,'202/월/10:30~11:45'),(30,2016,'1학기','전선','AH014-16','소프트웨어 캡스톤디자인',4,'405/월/12:00~14:45'),(31,2016,'1학기','전필','AH043-16','과정지도5',4,'202/화/12:00~12:50'),(32,2017,'2학기','전선','AH040-17','고급웹프로그래밍 II',4,'202/월/09:00~10:15'),(33,2016,'2학기','전선','AH045-16','모바일 프로그래밍 I',4,'202/월/10:30~11:45'),(34,2019,'2학기','전선','AH061-19','Java 프로젝트',4,'202/월/12:00~14:50'),(35,2016,'2학기','전필','AH044-16','과정지도6',4,'402/목/13:00~13:50'),(36,2016,'2학기','전선','AH040-16','고급웹프로그래밍 II',4,'202/월/09:00~10:15'),(37,2017,'2학기','전선','AH045-17','모바일 프로그래밍 I',4,'405/월/10:30~11:45'),(38,2018,'2학기','전선','AH061-18','Java 프로젝트',4,'202/월/12:00~14:45'),(39,2017,'2학기','전필','AH044-17','과정지도6',4,'202/목/16:30~17:20'),(40,2016,'2학기','전선','AH042-16','통계자료분석 및 실습',5,'401/화/15:00~16:15'),(41,2017,'2학기','전선','AH042-17','통계자료분석 및 실습',5,'401/월/16:30~17:45'),(42,2016,'2학기','전필','AH020-16','웹페이지구축Ⅰ',7,'202/화/09:00~10:15'),(43,2017,'2학기','전필','AH020-17','웹페이지구축Ⅰ',7,'202/화/10:30~11:45'),(44,2017,'1학기','전필','AH003-17','데이타베이스개론',6,'202/화/10:30~11:45'),(45,2018,'2학기','전선','AH030-18','데이터베이스 캡스톤디자인',6,'405/월/15:00~17:45'),(46,2017,'2학기','전선','AH030-17','데이터베이스 캡스톤디자인',6,'405/화/12:00~14:50'),(47,2017,'2학기','전필','AH034-17','과정지도2',6,'202/수/14:00~14:50'),(48,2016,'2학기','전선','AH060-16','Python 프로그래밍',6,'202/월/16:30~17:45'),(50,2017,'2학기','전선','AH056-17','IT취업실무I',6,'401/월/18:25~21:20'),(51,2019,'1학기','전필','AH007-19','자바프로그래밍',2,'405/화/16:30~17:45'),(52,2018,'1학기','전필','AH007-18','자바프로그래밍',2,'202/화/15:00~16:15'),(53,2018,'1학기','전필','AH017-18','과정지도3',2,'202/화/14:00~14:50'),(54,2019,'2학기','전필','AH021-19','자료구조론',2,'202/화/16:30~17:45'),(55,2018,'2학기','전필','AH021-18','자료구조론',2,'202/화/15:00~16:15'),(56,2014,'2학기','전필','AH039-14','과정지도4',2,'202/화/14:00~14:50'),(57,2020,'2학기','전필','AH021-20','자료구조론',2,'202/금/15:00~17:45'),(58,2023,'2학기','전필','AH021-23','자료구조론',2,'202/화/16:30~17:45'),(59,2015,'2학기','전필','AH039-15','과정지도4',2,'202/목/14:00~14:50'),(60,2019,'1학기','전필','AH003-19','데이타베이스개론',1,'202/월/15:00~16:15'),(61,2019,'1학기','전선','AH006-19','시스템분석 및 설계',1,'202/월/16:30~17:45'),(62,2019,'1학기','전선','AH036-19','C++프로그래밍',1,'202/수/12:00~14:45'),(63,2016,'2학기','전선','AH024-16','UNIX',1,'202/수/12:00~14:50'),(64,2015,'2학기','전선','AH028-15','데이터베이스실습',1,'202/월/15:00~16:15'),(65,2017,'2학기','전선','AH037-17','웹페이지구축III',1,'202/월/16:30~17:45'),(66,2019,'2학기','전선','AH024-19','UNIX',1,'405/수/12:00~14:45'),(67,2016,'2학기','전선','AH028-16','데이터베이스실습',1,'405/월/16:30~17:45'),(68,2018,'2학기','전선','AH037-18','웹페이지구축III',1,'405/월/15:00~16:15'),(69,2020,'1학기','전필','AH002-20','컴퓨터구조',3,'302/화/09:00~10:15'),(70,2020,'1학기','전선','AH009-20','데이터통신',3,'402/화/15:00~16:15'),(71,2020,'1학기','전선','AH029-20','사물인터넷기초',3,'405/화/10:30~11:45'),(72,2020,'1학기','전필','AH033-20','졸업지도',3,'402/화/13:00~13:50'),(73,2021,'2학기','전필','AH005-21','운영체제론',3,'302/화/10:30~11:45'),(74,2021,'2학기','전선','AH018-21','사물인터넷 캡스톤디자인',3,'405/화/12:00~14:50'),(75,2020,'2학기','전필','AH005-20','운영체제론',3,'302/화/10:30~11:45'),(76,2020,'2학기','전선','AH018-20','사물인터넷 캡스톤디자인',3,'405/목/12:00~14:45'),(77,2020,'2학기','전선','AH019-20','C프로그래밍Ⅱ',3,'202/월/10:30~11:45'),(78,2021,'1학기','전필','AH010-21','알고리즘',4,'202/월/09:00~10:15'),(79,2021,'1학기','전선','AH011-21','고급웹프로그래밍 I',4,'202/월/10:30~11:45'),(80,2021,'1학기','전선','AH014-21','소프트웨어 캡스톤디자인',4,'405/월/12:00~14:45'),(81,2017,'1학기','전필','AH043-17','과정지도5',4,'202/화/12:00~12:50'),(82,2018,'2학기','전선','AH040-18','고급웹프로그래밍 II',4,'202/월/09:00~10:15'),(83,2018,'2학기','전선','AH045-18','모바일 프로그래밍 I',4,'202/월/10:30~11:45'),(84,2016,'2학기','전선','AH061-16','Java 프로젝트',4,'202/월/12:00~14:50'),(85,2018,'2학기','전필','AH044-18','과정지도6',4,'402/목/13:00~13:50'),(86,2019,'2학기','전선','AH040-19','고급웹프로그래밍 II',4,'202/월/09:00~10:15'),(87,2019,'2학기','전선','AH045-19','모바일 프로그래밍 I',4,'405/월/10:30~11:45'),(88,2017,'2학기','전선','AH061-17','Java 프로젝트',4,'202/월/12:00~14:45'),(89,2019,'2학기','전필','AH044-19','과정지도6',4,'202/목/16:30~17:20'),(90,2018,'2학기','전선','AH042-18','통계자료분석 및 실습',5,'401/화/15:00~16:15'),(91,2019,'2학기','전선','AH042-19','통계자료분석 및 실습',5,'401/월/16:30~17:45'),(92,2021,'2학기','전필','AH020-21','웹페이지구축Ⅰ',7,'202/화/09:00~10:15'),(93,2022,'2학기','전필','AH020-22','웹페이지구축Ⅰ',7,'202/화/10:30~11:45'),(94,2022,'1학기','전필','AH003-22','데이타베이스개론',6,'202/화/10:30~11:45'),(95,2022,'2학기','전선','AH030-22','데이터베이스 캡스톤디자인',6,'405/월/15:00~17:45'),(96,2021,'2학기','전선','AH030-21','데이터베이스 캡스톤디자인',6,'405/화/12:00~14:50'),(97,2022,'2학기','전필','AH034-22','과정지도2',6,'202/수/14:00~14:50'),(98,2017,'2학기','전선','AH060-17','Python 프로그래밍',6,'202/월/16:30~17:45'),(99,2016,'2학기','전선','AH056-16','IT취업실무I',6,'401/월/18:25~21:20');
/*!40000 ALTER TABLE `course` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `professor`
--

DROP TABLE IF EXISTS `professor`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `professor` (
  `id` int NOT NULL,
  `name` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `professor`
--

LOCK TABLES `professor` WRITE;
/*!40000 ALTER TABLE `professor` DISABLE KEYS */;
INSERT INTO `professor` VALUES (1,'김성유'),(2,'문임은'),(3,'이전영'),(4,'박온선'),(5,'배운경'),(6,'서용화'),(7,'오유정');
/*!40000 ALTER TABLE `professor` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-05-21  9:15:22
